### Report for degrades-dashboards on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (16 to add, 3 to change, 16 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.degrades_daily_summary_lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "degrades_daily_summary_lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.degrades_message_receiver_lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "degrades_message_receiver_lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_api_gateway_deployment.degrades_api_deploy will be destroyed
  # (because aws_api_gateway_deployment.degrades_api_deploy is not in configuration)
  - resource "aws_api_gateway_deployment" "degrades_api_deploy" {
      - created_date  = "2025-06-09T11:26:24Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-west-2:343515223843:k9agkrdrn4/" -> null
      - id            = "jpi3ul" -> null
      - invoke_url    = "https://k9agkrdrn4.execute-api.eu-west-2.amazonaws.com/" -> null
      - rest_api_id   = "k9agkrdrn4" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.degrades_get will be destroyed
  # (because aws_api_gateway_integration.degrades_get is not in configuration)
  - resource "aws_api_gateway_integration" "degrades_get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "ll4uf2" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-k9agkrdrn4-ll4uf2-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "ll4uf2" -> null
      - rest_api_id             = "k9agkrdrn4" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_api_dashboards_lambda/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.degrades_get will be destroyed
  # (because aws_api_gateway_method.degrades_get is not in configuration)
  - resource "aws_api_gateway_method" "degrades_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-k9agkrdrn4-ll4uf2-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "ll4uf2" -> null
      - rest_api_id          = "k9agkrdrn4" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.degrades will be destroyed
  # (because aws_api_gateway_resource.degrades is not in configuration)
  - resource "aws_api_gateway_resource" "degrades" {
      - id          = "ll4uf2" -> null
      - parent_id   = "nzv0039to5" -> null
      - path        = "/degrades" -> null
      - path_part   = "degrades" -> null
      - rest_api_id = "k9agkrdrn4" -> null
    }

  # aws_api_gateway_rest_api.degrades_api will be destroyed
  # (because aws_api_gateway_rest_api.degrades_api is not in configuration)
  - resource "aws_api_gateway_rest_api" "degrades_api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:eu-west-2::/restapis/k9agkrdrn4" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2025-06-09T11:26:11Z" -> null
      - description                  = "API for Degrades work" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:eu-west-2:343515223843:k9agkrdrn4" -> null
      - id                           = "k9agkrdrn4" -> null
      - name                         = "degrades_api" -> null
      - root_resource_id             = "nzv0039to5" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null
        # (2 unchanged attributes hidden)

      - endpoint_configuration {
          - ip_address_type  = "ipv4" -> null
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # aws_api_gateway_stage.degrades will be destroyed
  # (because aws_api_gateway_stage.degrades is not in configuration)
  - resource "aws_api_gateway_stage" "degrades" {
      - arn                   = "arn:aws:apigateway:eu-west-2::/restapis/k9agkrdrn4/stages/dev" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "jpi3ul" -> null
      - execution_arn         = "arn:aws:execute-api:eu-west-2:343515223843:k9agkrdrn4/dev" -> null
      - id                    = "ags-k9agkrdrn4-dev" -> null
      - invoke_url            = "https://k9agkrdrn4.execute-api.eu-west-2.amazonaws.com/dev" -> null
      - rest_api_id           = "k9agkrdrn4" -> null
      - stage_name            = "dev" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.degrades_daily_summary_lambda_schedule will be created
  + resource "aws_cloudwatch_event_rule" "degrades_daily_summary_lambda_schedule" {
      + arn                 = (known after apply)
      + description         = "Schedule for Degrades Daily Summary Lambda"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev_degrades_daily_summary_lambda_schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 6 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.degrades_daily_summary_lambda will be created
  + resource "aws_cloudwatch_event_target" "degrades_daily_summary_lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "dev_degrades_daily_summary_lambda_schedule"
      + target_id      = "degrades_daily_summary_lambda_schedule"
    }

  # aws_cloudwatch_log_group.degrades_daily_summary will be created
  + resource "aws_cloudwatch_log_group" "degrades_daily_summary" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/dev_degrades_daily_summary_lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.degrades_message_receiver will be created
  + resource "aws_cloudwatch_log_group" "degrades_message_receiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/dev_degrades_message_receiver_lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.degrades_messages_receiver will be destroyed
  # (because aws_cloudwatch_log_group.degrades_messages_receiver is not in configuration)
  - resource "aws_cloudwatch_log_group" "degrades_messages_receiver" {
      - arn               = "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev_degrades_message_receiver_lambda" -> null
      - id                = "/aws/lambda/dev_degrades_message_receiver_lambda" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/dev_degrades_message_receiver_lambda" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.degrades_daily_summary_logging will be created
  + resource "aws_iam_policy" "degrades_daily_summary_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "degrades_daily_summary_lambda_logging_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.degrades_message_receiver_logging will be updated in-place
  ~ resource "aws_iam_policy" "degrades_message_receiver_logging" {
        id               = "arn:aws:iam::343515223843:policy/degrades_message_receiver_lambda_logging"
        name             = "degrades_message_receiver_lambda_logging"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev_degrades_message_receiver_lambda:*",
                          - "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev_degrades_message_receiver_lambda",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.degrades_message_table_access must be replaced
-/+ resource "aws_iam_policy" "degrades_message_table_access" {
      ~ arn              = "arn:aws:iam::343515223843:policy/degrades_table_access_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::343515223843:policy/degrades_table_access_policy" -> (known after apply)
      ~ name             = "degrades_table_access_policy" -> "degrades_message_table_access_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPAU76Y2K4R6NRC3YHSG" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_layer will be updated in-place
  ~ resource "aws_iam_policy" "lambda_layer" {
        id               = "arn:aws:iam::343515223843:policy/lambda_layer_policy"
        name             = "lambda_layer_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:GetLayerVersion",
                          - "lambda:ListLayerVersions",
                          - "lambda:ListLayers",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:eu-west-2:343515223843:layer:dev_degrades_lambda_layer:1:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.read_registrations_mi_events will be destroyed
  # (because aws_iam_policy.read_registrations_mi_events is not in configuration)
  - resource "aws_iam_policy" "read_registrations_mi_events" {
      - arn              = "arn:aws:iam::343515223843:policy/dev-degrades_api_dashboards_lambda" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::343515223843:policy/dev-degrades_api_dashboards_lambda" -> null
      - name             = "dev-degrades_api_dashboards_lambda" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:List*",
                          - "s3:Get*",
                          - "s3:Describe*",
                          - "s3-object-lambda:List*",
                          - "s3-object-lambda:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::prm-gp-registrations-mi-events-dev/*",
                          - "arn:aws:s3:::prm-gp-registrations-mi-events-dev",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAU76Y2K4RUMCDIWQOM" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.registrations_mi_events_access will be created
  + resource "aws_iam_policy" "registrations_mi_events_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "regristrations_mi_events_read_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:RestoreObject",
                          + "s3:PutObjectVersionTagging",
                          + "s3:ListBucketVersions",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectVersionAttributes",
                          + "s3:GetObjectVersionAcl",
                          + "s3:GetObjectVersion",
                          + "s3:GetObjectTagging",
                          + "s3:GetObjectRetention",
                          + "s3:GetObjectAttributes",
                          + "s3:GetObjectAcl",
                          + "s3:GetObject",
                          + "s3:DeleteObjectVersionTagging",
                          + "s3:DeleteObjectVersion",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prm-gp-registrations-mi-events-dev/*",
                          + "arn:aws:s3:::prm-gp-registrations-mi-events-dev",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.degrades_api_lambda_role will be destroyed
  # (because aws_iam_role.degrades_api_lambda_role is not in configuration)
  - resource "aws_iam_role" "degrades_api_lambda_role" {
      - arn                   = "arn:aws:iam::343515223843:role/dev_degrades_api_lambda_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-19T13:50:13Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dev_degrades_api_lambda_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::343515223843:policy/dev-degrades_api_dashboards_lambda",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dev_degrades_api_lambda_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAU76Y2K4RZ4AXUAPA3" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.degrades_daily_summary_lambda will be created
  + resource "aws_iam_role" "degrades_daily_summary_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "degrades_daily_summary_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.degrades_api_lambda_s3_read will be destroyed
  # (because aws_iam_role_policy_attachment.degrades_api_lambda_s3_read is not in configuration)
  - resource "aws_iam_role_policy_attachment" "degrades_api_lambda_s3_read" {
      - id         = "dev_degrades_api_lambda_role-20250619153000389500000001" -> null
      - policy_arn = "arn:aws:iam::343515223843:policy/dev-degrades_api_dashboards_lambda" -> null
      - role       = "dev_degrades_api_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.degrades_daily_summary_degrades_message_table_access will be created
  + resource "aws_iam_role_policy_attachment" "degrades_daily_summary_degrades_message_table_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "degrades_daily_summary_lambda_role"
    }

  # aws_iam_role_policy_attachment.degrades_daily_summary_logging will be created
  + resource "aws_iam_role_policy_attachment" "degrades_daily_summary_logging" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "degrades_daily_summary_lambda_role"
    }

  # aws_iam_role_policy_attachment.degrades_daily_summary_registrations_mi_event_read will be created
  + resource "aws_iam_role_policy_attachment" "degrades_daily_summary_registrations_mi_event_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "degrades_daily_summary_lambda_role"
    }

  # aws_iam_role_policy_attachment.degrades_message_receiver_lambda_dynamodb must be replaced
-/+ resource "aws_iam_role_policy_attachment" "degrades_message_receiver_lambda_dynamodb" {
      ~ id         = "degrades_message_receiver_lambda_role-20250619135020897700000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::343515223843:policy/degrades_table_access_policy" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.degrades_message_receiver_logs will be created
  + resource "aws_iam_role_policy_attachment" "degrades_message_receiver_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::343515223843:policy/degrades_message_receiver_lambda_logging"
      + role       = "degrades_message_receiver_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_logs will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_logs is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_logs" {
      - id         = "degrades_message_receiver_lambda_role-20250619145918561800000001" -> null
      - policy_arn = "arn:aws:iam::343515223843:policy/degrades_message_receiver_lambda_logging" -> null
      - role       = "degrades_message_receiver_lambda_role" -> null
    }

  # aws_lambda_function.degrades_api_lambda will be destroyed
  # (because aws_lambda_function.degrades_api_lambda is not in configuration)
  - resource "aws_lambda_function" "degrades_api_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_api_dashboards_lambda" -> null
      - code_sha256                    = "fushA1RtxVK+ur6Ou0hPTZUSFfCLNio/Q7EA07UrYps=" -> null
      - filename                       = "lambda/build/degrades-api-dashboards.zip" -> null
      - function_name                  = "dev_degrades_api_dashboards_lambda" -> null
      - handler                        = "main.lambda_handler" -> null
      - id                             = "dev_degrades_api_dashboards_lambda" -> null
      - invoke_arn                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_api_dashboards_lambda/invocations" -> null
      - last_modified                  = "2025-07-04T14:22:38.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:eu-west-2:343515223843:layer:dev_degrades_lambda_layer:1",
        ] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_api_dashboards_lambda:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_api_dashboards_lambda:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::343515223843:role/dev_degrades_api_lambda_role" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "fushA1RtxVK+ur6Ou0hPTZUSFfCLNio/Q7EA07UrYps=" -> null
      - source_code_size               = 2582 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 45 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "REGISTRATIONS_MI_EVENT_BUCKET" = "prm-gp-registrations-mi-events-dev"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/dev_degrades_api_dashboards_lambda" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.degrades_daily_summary will be created
  + resource "aws_lambda_function" "degrades_daily_summary" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./lambda/build/degrades-daily-summary.zip"
      + function_name                  = "dev_degrades_daily_summary_lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "pZpvkfRlF1PBVoT13I6SIQbbQy25EuGra6xkgWQGqbk="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.degrades_message_receiver will be updated in-place
  ~ resource "aws_lambda_function" "degrades_message_receiver" {
        id                             = "dev_degrades_message_receiver_lambda"
      ~ last_modified                  = "2025-07-04T16:31:47.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:343515223843:layer:dev_degrades_lambda_layer:4",
        ] -> (known after apply)
      ~ source_code_hash               = "Iz6AqYX+cO55ebJSeKEVRmVMAq0mzc8jpt9OPv3F+AU=" -> "QXr+zHz1cMvX4G59EHdLqjzpZC+78XvJIDMb2dPtIcg="
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.degrades must be replaced
-/+ resource "aws_lambda_layer_version" "degrades" {
      ~ arn                         = "arn:aws:lambda:eu-west-2:343515223843:layer:dev_degrades_lambda_layer:1" -> (known after apply)
      ~ code_sha256                 = "Sa3YUANRRlgV3hnOkdJtK/WKYpo9ZSPdATzR0DPRIiY=" -> (known after apply)
      ~ created_date                = "2025-07-04T14:22:32.283+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-west-2:343515223843:layer:dev_degrades_lambda_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-west-2:343515223843:layer:dev_degrades_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Sa3YUANRRlgV3hnOkdJtK/WKYpo9ZSPdATzR0DPRIiY=" -> "6Lyn7HLKfAYwnKGdpTgmJ/45G85+FQjBcXX3q1lJmko=" # forces replacement
      ~ source_code_size            = 28063920 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_permission.degrades_daily_summary_schedule will be created
  + resource "aws_lambda_permission" "degrades_daily_summary_schedule" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev_degrades_daily_summary_lambda"
      + id                  = (known after apply)
      + principal           = "eventsa.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.lambda_permission will be destroyed
  # (because aws_lambda_permission.lambda_permission is not in configuration)
  - resource "aws_lambda_permission" "lambda_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "dev_degrades_api_dashboards_lambda" -> null
      - id                  = "terraform-20250619145929221400000002" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - source_arn          = "arn:aws:execute-api:eu-west-2:343515223843:k9agkrdrn4/*/*" -> null
      - statement_id        = "terraform-20250619145929221400000002" -> null
      - statement_id_prefix = "terraform-" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 16 to add, 3 to change, 16 to destroy.

```

</details>